# BadTreadRiserProfile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..BadTreadRiserProfile Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Tread/Riser profile is invalid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadTreadRiserProfile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadTreadRiserProfile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadTreadRiserProfile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace